{
  "architectures": [
    "DebertaV2ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-EMAIL",
    "2": "B-LOC",
    "3": "I-LOC",
    "4": "B-MISC",
    "5": "I-MISC",
    "6": "B-NAME_STUDENT",
    "7": "I-NAME_STUDENT",
    "8": "B-ORG",
    "9": "I-ORG",
    "10": "B-PER",
    "11": "I-PER",
    "12": "B-PHONE_NUM",
    "13": "I-PHONE_NUM",
    "14": "B-STREET_ADDRESS",
    "15": "I-STREET_ADDRESS",
    "16": "B-URL_PERSONAL",
    "17": "B-USERNAME"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-EMAIL": 1,
    "B-LOC": 2,
    "B-MISC": 4,
    "B-NAME_STUDENT": 6,
    "B-ORG": 8,
    "B-PER": 10,
    "B-PHONE_NUM": 12,
    "B-STREET_ADDRESS": 14,
    "B-URL_PERSONAL": 16,
    "B-USERNAME": 17,
    "I-LOC": 3,
    "I-MISC": 5,
    "I-NAME_STUDENT": 7,
    "I-ORG": 9,
    "I-PER": 11,
    "I-PHONE_NUM": 13,
    "I-STREET_ADDRESS": 15,
    "O": 0
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.4",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
